app/controllers/books_controller.rb

  def index
    @books = Book.page(params['page']).per(3)
---
SELECT  "books".* FROM "books" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "books"

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "description", "author", "paper", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Swift"], ["description", "A apple dev tool book"], ["author", "peter"], ["paper", 350], ["created_at", "2015-11-16 11:31:39.581565"], ["updated_at", "2015-11-16 11:31:39.581565"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "cover_page" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["cover_page", "IMG_0016.JPG"], ["updated_at", "2015-11-16 12:42:33.888084"], ["id", 4]]